{
    "gender": "gender",
    "male": "male",
    "nationality": "nationality",
    "brazilian": "brazilian",
    "work-experience": "work experience",
    "role": "role",
    "fullstack_developer": "fullstack developer",
    "backend_developer": "backend developer",
    "test_engineer": "test engineer",
    "software_developer": "software developer",
    "company": "company",
    "seme": "Municipal Department of Sports",
    "from": "from",
    "to": "to",
    "city": "city",
    "country": "country",
    "description": "description",
    "job_description": {
        "btg": "BTG Pactual is an investment bank in Brazil. I integrate the onBoarding team, responsible for developing the systems the first receive the customers (data validation, profile checks, account creation, etc.). Working under SCRUM agile methodology as a Fullstack developer (.Net C# and React) I started helping the bank to conclude the development of a system responsible for verifying if a customer (person or company) were or weren't reportable to financial institutions. The system run a set of rules on the customer account data and saves the results in the MySQL database (EntityFramework as ORM). We used some design patterns to achieve good results like Factory method and Chain of Responsibility. The results are viewed by the bank analysts through a Web Page developed in React. Now, working in another team with 5 developers, 1 QA, and 2 POs, I develop a system that enables the creation of offshore (USA, Cayman, Colombia) customers accounts easily by using a Workflow. We use the .NET C# language and also React with Typescript to develop the front end page that is used to input the customers informations. There are a lot of microservices involved that our system uses so I also have to know a little about them to make the communication works perfectly.",
        "emdia": "emDia is a Santander Bank company. Its objective is offer clients an economic way to pay their debts by giving them good discounts. At first I worked as a senior test automation developer in QA area. But shortly (one month later), I started working as a software developer creating Web APIs using the .Net C# language. These web APIs consumed a public API to get clients financial informations. Dapper was used as the ORM. I also performed the maintenance of a broker system developed in Node and TypeScript that used some AWS technologies (Amazon Web Services), such as: API Gateway, Lambda; S3; Dynamo; Cloudwatch, SNS. I Also helped the company emDia to implement a chatbot (IBM Watson) on its webpage; Creating chatbot dialogs that consumed the Web APIs I had created before.",
        "bizzap": "Working allocated in a client site (CIP - Interbank Payment Chamber) at Faria Lima - SP, automating functional tests using C#, Selenium and BDD (Specflow). Developing web interface tests integrated with extent reports (which generates report results with screenshots after test completion). SCRUM was used as the agile methodology.",
        "hdi": "HDI Group is a company specialized in test automation. My role was QA automation developer. My main job was about creating automated tests for the UI Web solutions of our clients (a variaty of clients like retail and insurance companies). The test automation was done using Java, so at the same time I was developing the tests I learned a lot about TDD, OOP, Java, Selenium and Git. I worked in a team with more or less 10 people from the QA area (manual analists and test developers).",
        "edok": "My second internship as a software developer (total of 2 years of internship). Edok is a startup that digitalizes phisical documents. It was my very first contact with an OOP programming language (PHP). I learned the basics of this language from the seniores of the project. I helped the team by giving support and developing basic to intermediate functions using the PHP programming language. The team was me and four seniores developers.",
        "sec_sports": "It was my first internship working as a software developer. I used to work four hours a day during the week giving support and developing basic methods/functions using the VB.net programming language. I started leaning better the usage of data structure such asArrays and loops such as While and For."
    },
    "uninove": "university nove de julho",
    "science_computer": "science computer bachelor",
    "information_technician": "information technology technician",
    "address": "address",
    "education": "education",
    "course": "course",
    "school": "school",
    "portuguese": "portuguese",
    "english": "english",
    "english-fluency": {
        "listening": "listening",
        "speaking": "speaking",
        "reading": "reading",
        "writing": "writing"
    },
    "mother-tongue": "mother tongue",
    "other-languages": "other languages",
    "language-skills": "language-skills",
    "digital-skills": "digital skills",
    "unit-test": "unit test",
    "oop": "oop",
    "design-patterns": "design patterns",
    "current": "current",
    "no-knowledge": "no knowledge",
    "not-good": "almost no knowledge",
    "now-a-bit": "know a bit",
    "good": "good",
    "very-good": "very good",
    "excellent": "excellent"
}