{
    "gender": "gênero",
    "male": "masculino",
    "nationality": "nacionalidade",
    "brazilian": "brasileira",
    "work-experience": "experiências profissionais",
    "role": "função",
    "fullstack_developer": "desenvolvedor fullstack",
    "backend_developer": "desenvolvedor backend",
    "test_engineer": "engenheiro de teste",
    "software_developer": "desenvolvedor de software",
    "company": "empresa",
    "seme": "secretaria municipal de esportes",
    "from": "de",
    "to": "até",
    "city": "cidade",
    "country": "país",
    "description": "descrição",
    "job_description": {
        "btg": "BTG Pactual é um banco de investimento no Brasil. Integro a equipe de onBoarding, responsável pelo desenvolvimento dos sistemas de recepção dos clientes (validação de dados, verificação de perfis, criação de contas, etc.). Trabalhando na metodologia ágil SCRUM como desenvolvedor Fullstack (.Net C# e React) comecei ajudando o banco a concluir o desenvolvimento de um sistema responsável por verificar se um cliente (pessoa ou empresa) era ou não reportável a instituições financeiras. O sistema executa um conjunto de regras nos dados da conta do cliente e salva os resultados no banco de dados MySQL (EntityFramework como ORM).",
        "emdia": "A emDia é uma empresa do Banco Santander. Seu objetivo é oferecer aos clientesuma forma econômica de pagar suas dívidas, dando-lhes bons descontos. Inicialmente, trabalhei como desenvolvedor sênior de automação de testes na área deQA, mas um mês depois, comecei a trabalhar como desenvolvedor de software backend criando APIs Web usando a linguagem .Net C#. Dapper era utilizado como ORM. Essas APIs da web consumiam uma API pública para obter informações financeirasdos clientes. Alguns se comunicam com o AWS DynamoDB. Também realizei manutenção de sistema de broker desenvolvido em Node eTypeScript que utilizava algumas tecnologias AWS (Amazon Web Services), como:API Gateway, Lambda; S3; DynamoDB; CloudWatch, SNS. Além disso, ajudei a empresa emDia a implementar um chatbot (IBM Watson) em suapágina web; Criando diálogos de chatbot que consumia as APIs da Web que eu haviacriado antes.",
        "bizzap": "Trabalhando alocado no cliente (CIP - Câmara Interbancária de Pagamentos) na FariaLima - SP, automatizando testes funcionais usando. Net Framework C# , Selenium e BDD (Specflow). Desenvolvimento de testes de interface web integrados com relatórios de extensão(gerando resultados de relatórios com capturas de tela após a conclusão do teste). SCRUM foi utilizado como metodologia ágil.",
        "hdi": "Minha função era a de desenvolvedor de automação de testes no controle dequalidade. Meu trabalho principal era criar testes automatizados para as soluções UIWeb de nossos clientes (uma variedade de clientes como varejistas e seguradoras). A automação dos testes era desenvolvida em Java, então ao mesmo tempo em quedesenvolvia os testes aprendi muito sobre TDD, Java, Selenium e Git. Trabalhei em uma equipe com mais ou menos 10 pessoas da área de QA (analistasde manuais e desenvolvedores de testes).",
        "edok": "Meu segundo estágio como desenvolvedor de software. A Edok é uma startup que digitaliza documentos físicos. Foi meu primeiro contato com uma linguagem de programação OOP (PHP). Aprendi o básico dessa linguagem com os veteranos do projeto. Ajudei a equipedando suporte e desenvolvendo funções básicas a intermediárias utilizando a linguagem de programação PHP. A equipe era eu e outros quatrodesenvolvedores seniores.",
        "sec_sports": "Foi meu primeiro estágio trabalhando como desenvolvedor de software. Eu trabalhava quatro horas por dia durante a semana dando suporte e desenvolvendométodos/funções básicas usando a linguagem de programação VB.net. Comecei a aprender melhor o uso de estrutura de dados como Arrays e loops comoWhile e For, entre outros assuntos da faculdade."
    },
    "uninove": "universidade nove de julho (UNINOVE)",
    "science_computer": "bacharelado em ciência da computação",
    "information_technician": "técnico em informática",
    "address": "endereço",
    "education": "educação",
    "course": "curso",
    "school": "escola",
    "portuguese": "português",
    "english": "inglês",
    "english-fluency": {
        "listening": "audição",
        "speaking": "fala",
        "reading": "leitura",
        "writing": "escrita"
    },
    "mother-tongue": "língua nativa",
    "other-languages": "outras línguas",
    "language-skills": "idiomas",
    "digital-skills": "habilidades digitais",
    "unit-test": "teste unitário",
    "oop": "poo",
    "design-patterns": "padrões de projeto",
    "current": "atual"
}