{
    "gender": "gênero",
    "male": "masculino",
    "nationality": "nacionalidade",
    "brazilian": "brasileira",
    "work-experience": "experiências profissionais",
    "role": "função",
    "fullstack_developer": "desenvolvedor fullstack",
    "backend_developer": "desenvolvedor backend",
    "test_engineer": "engenheiro de teste",
    "software_developer": "desenvolvedor de software",
    "oracle-retail-consultant": "consultor Oracle Retail",
    "sap-crm-consultant": "consultor SAP CRM",
    "company": "empresa",
    "seme": "Secretaria Municipal de Esportes",
    "from": "de",
    "to": "até",
    "city": "cidade",
    "country": "país",
    "description": "descrição",
    "job_description": {
        "btg": "BTG Pactual é um banco de investimento no Brasil. Integro a equipe de onBoarding, responsável pelo desenvolvimento dos sistemas de recepção dos clientes (validação de dados, verificação de perfis, criação de contas, etc.). Trabalhando na metodologia ágil SCRUM como desenvolvedor Fullstack (.Net C# e React) comecei ajudando o banco a concluir o desenvolvimento de um sistema responsável por verificar se um cliente (pessoa ou empresa) era ou não reportável a instituições financeiras. O sistema executa um conjunto de regras nos dados da conta do cliente e salva os resultados no banco de dados MySQL (EntityFramework como ORM). Utilizamos alguns design patterns para obter bons resultados, como o factory methode a chain of responsibility. Os resultados são visualizados pelos analistas do bancoatravés de uma página Web desenvolvida em React. Agora, trabalhando em outra equipe com 5 desenvolvedores, 1 QA e 2 POs,desenvolvo um sistema que permite a criação de contas de clientes offshore (EUA,Cayman, Colômbia) facilmente usando um Workflow. Utilizamos a linguagem C# etambém React com Typescript para desenvolver a página inicial que é utilizada parainserir as informações dos clientes. Existem muitos microserviços envolvidos quenosso sistema usa, então também tenho que saber um pouco sobre eles.",
        "emdia": "A emDia é uma empresa do Banco Santander. Seu objetivo é oferecer aos clientes uma forma econômica de pagar suas dívidas, dando-lhes bons descontos. Inicialmente, trabalhei como desenvolvedor sênior de automação de testes na área de QA, mas um mês depois, comecei a trabalhar como desenvolvedor de software backend criando APIs Web usando a linguagem .Net C#. Dapper era utilizado como ORM. Essas WEB APIs consumiam uma API pública para obter informações financeiras dos clientes. Também realizei a manutenção de um sistema broker desenvolvido em Node e TypeScript e que utilizava algumas tecnologias AWS (Amazon Web Services), como: API Gateway, Lambda; S3; DynamoDB; CloudWatch, SNS. Além disso, ajudei a empresa emDia a implementar um chatbot (IBM Watson) em sua página web; Criando diálogos de chatbot que consumia as WEB APIs que eu havia criado anteriormente.",
        "bizzap": "Trabalhando alocado no cliente (CIP - Câmara Interbancária de Pagamentos) na Faria Lima - SP, automatizando testes funcionais usando a plataforma .Net Framework e linguagem C#, juntamente com Selenium e BDD (Specflow). Desenvolvimento de testes de interface web integrados com a ferramente extent reports (gerando resultados de relatórios com capturas de tela após a conclusão dos testes). SCRUM foi utilizado como metodologia ágil.",
        "hdi": "Minha função era a de desenvolvedor de automação de testes no controle dequalidade. Meu trabalho principal era criar testes automatizados para as soluções UIWeb de nossos clientes (uma variedade de clientes como varejistas e seguradoras). A automação dos testes era desenvolvida em Java, então ao mesmo tempo em quedesenvolvia os testes aprendi muito sobre TDD, Java, Selenium e Git. Trabalhei em uma equipe com mais ou menos 10 pessoas da área de QA (analistasde manuais e desenvolvedores de testes).",
        "logic-info": "Trabalhei inicialmente no time de suporte ao ORMS (Oracle Retail Merchadising System), mantendo sistemas já existentes. Basicamente, o trabalho era constituído em análise de dados, escrita de scripts em shell e criação de procedures em PL/SQL. Depois, passei a fazer parte do \"time de projetos\", viajando para alguns clientes no Brasil para implementação de novos projetos. Durante esta experiência tive a oportunidade de trabalhar com BI Publisher e com o Módulo RDF (Oracle Retail Demand Forecasting).",
        "accenture": "Equipe de suporte, respondendo e-mails e ligações pelo CRM (Relacionamento com o Cliente Management) da plataforma SAP ISU/CCS.",
        "edok": "Meu segundo estágio como desenvolvedor de software. A Edok é uma startup que digitaliza documentos físicos. Foi meu primeiro contato com uma linguagem de programação OOP (PHP). Aprendi o básico dessa linguagem com os seniores do projeto. Ajudei a equipe dando suporte e desenvolvendo funções básicas a intermediárias utilizando a linguagem de programação PHP. A equipe era composta por mim e outros quatro desenvolvedores seniores.",
        "sec_sports": "Foi meu primeiro estágio trabalhando como desenvolvedor de software. Eu trabalhava quatro horas por dia durante a semana dando suporte e desenvolvendo funcionalidades básicas usando a linguagem de programação VB.net. Comecei a aprender melhor o uso de estrutura de dados como Arrays e loops como While e For, entre outros assuntos vistos durante ensino técnico e faculdade.",
        "byggfakta": "Como desenvolvedor backend no cliente Byggfakta (uma empresa sueca líder de software e informações no setor de construção), estou ajudando a equipa na modernização da stack de tecnologia na migração de sistemas PHP legados para sistemas .NET 8 com C#. Sou basicamente responsável por criar endpoints Restfull que executam operações CRUD, manter a qualidade, facilidade em ler e manter o código. Utilizando os princípios SOLID, design patterns, também incluindo uma alta cobertura do código por meio de unit tests, reduzindo drasticamente o número de potenciais bugs e tempo para solução de problemas. Tecnologias envolvidas: .NET 8 C#, EF Core como ORM, Azure SQL Server Database, Git, Azure devops. Trabalhamos sob a metodologia SCRUM, em sprints de duas semanas e o inglês é amplamente utilizado em nossas reuniões."
    },
    "uninove": "universidade nove de julho (UNINOVE)",
    "science_computer": "bacharelado em ciência da computação",
    "information_technician": "técnico em informática",
    "address": "endereço",
    "education": "educação",
    "course": "curso",
    "school": "escola",
    "portuguese": "português",
    "english": "inglês",
    "english-fluency": {
        "listening": "audição",
        "speaking": "fala",
        "reading": "leitura",
        "writing": "escrita"
    },
    "mother-tongue": "língua nativa",
    "other-languages": "outras línguas",
    "language-skills": "idiomas",
    "digital-skills": "habilidades digitais",
    "unit-test": "teste unitário",
    "oop": "poo",
    "design-patterns": "padrões de projeto",
    "current": "atual",
    "no-knowledge": "sem conhecimento",
    "not-good": "conheço bem pouco",
    "now-a-bit": "conheço pouco",
    "good": "bom",
    "very-good": "muito bom",
    "excellent": "excelente",
    "brazil": "Brasil",
    "portugal": "Portugal",
    "lisbon": "Lisboa",
    "date":
    { 
        "years": "ano(s)",
        "months": "mes(es)",
        "days": "dia(s)"
    }
}